// Створіть функцію, яка використовує проміс для імітації затримки у 2 секунди перед поверненням значення.
// Вимоги:

// • Створіть функцію waitForTwoSeconds(), яка повертає проміс, що вирішується через 2 секунди.
// • Після виконання проміса функція повинна вивести в консоль повідомлення “2 секунди пройшло!”.

// * треба буде погугліть (або подитись кінець лекції)
// * використовуйте setTimeout()

const waitForTwoSeconds = new Promise ((resolve) =>{
    setTimeout( () => {
        resolve();
    }, 2_000);
});

waitForTwoSeconds.then(console.log(`2 секунди пройшло!`));